//// @file
//
// TODO: Brief Description of UEFI Driver MyWizardDriver
//  
// TODO: Detailed Description of UEFI Driver MyWizardDriver
//
// TODO: Copyright for UEFI Driver MyWizardDriver
//  
// TODO: License for UEFI Driver MyWizardDriver
// 
////

#langdef en-US "English"

#string STR_SAMPLE_FORM_SET_TITLE             #language en-US  "My Wizard  Driver Sample Formset"
#string STR_SAMPLE_FORM_SET_HELP              #language en-US  "Help for Sample Formset."
#string STR_SAMPLE_FORM1_TITLE                #language en-US  "My Wizard Driver"

#string STR_SUBTITLE_TEXT1                    #language en-US "My Wizard Driver Configuration"
#string STR_SUBTITLE_TEXT2                    #language en-US "Device XYZ Configuration"

#string STR_DEVICE_ENABLE_PROMPT              #language en-US "Enable Device"
#string STR_DEVICE_ENABLE_HELP                #language en-US "Check this box to enable this device."

#string STR_CONFIG_NAME_PROMPT                #language en-US "Configuration Name"
#string STR_CONFIG_NAME_HELP                  #language en-US "Configuration name."

#string STR_DEVICE_SPEED_MODE_PROMPT          #language en-US "Device Speed"
#string STR_DEVICE_SPEED_MODE_HELP            #language en-US "Choose device speed."
#string STR_SLOW_MODE                         #language en-US "Slow Mode"
#string STR_FAST_MODE                         #language en-US "Fast Mode"
#string STR_ULTRA_FAST_MODE                   #language en-US "Ultra Fast Mode"

#string STR_MAX_STORAGE_SIZE_VOLUME_PROMPT    #language en-US "Max Storage Size Per Volume (GB)"
#string STR_MAX_STORAGE_SIZE_VOLUME_HELP      #language en-US "Maximum storage size per volume in GB."

#string STR_STANDARD_DEFAULT_PROMPT           #language en-US "Standard Default"
#string STR_STANDARD_DEFAULT_RESET_PROMPT     #language en-US "Reset to Standard Default"
#string STR_STANDARD_DEFAULT_HELP             #language en-US "This will reset all the Questions to their standard default value."

#string STR_MANUFACTURE_DEFAULT_PROMPT        #language en-US "Manufacture Default"
#string STR_MANUFACTURE_DEFAULT_RESET_PROMPT  #language en-US "Reset to Manufacture Default"
#string STR_MANUFACTURE_DEFAULT_HELP          #language en-US "This will reset all the Questions to their manufacture default value."


#string STR_FORM2_TITLE                       #language en-US "MyWizardDriver Second Setup Page"
#string STR_DATE_PROMPT                       #language en-US "System Date"
#string STR_DATE_HELP                         #language en-US "This is the help for the Date (month/day/year). (Error checking will be done against month/day/year combinations that are not supported.)"
#string STR_TIME_PROMPT                       #language en-US "System Time"
#string STR_TIME_HELP                         #language en-US "This is the help for the Time (hour/minute/second)."
#string STR_ERROR_POPUP                       #language en-US "You typed in the wrong value!"

#string STR_GOTO_FORM1                        #language en-US "Enter Page 1"
#string STR_GOTO_FORM2                        #language en-US "Enter Page 2"
#string STR_GOTO_HELP                         #language en-US "This is my goto help"

#string STR_MY_DATE_PROMPT                    #language en-US "My System Date"

#string STR_MY_TIME_PROMPT                    #language en-US "My System Time"